MyProjects/restaurantApp/app/controllers/restaurants_controller.rb

	def create
		@restaurant = Restaurant.create!(post_params)
---
INSERT INTO "restaurants" ("created_at", "description", "name", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", "2014-05-23 10:42:11.836910"], ["description", "slkdslsdk"], ["name", "B"], ["updated_at", "2014-05-23 10:42:11.836910"]]