MyProjects/article_app/app/controllers/articles_controller.rb

SELECT "articles".* FROM "articles"
---
	def index    # always defualt action
	    @articles = Article.all

SELECT  "articles".* FROM "articles"  WHERE "articles"."id" = ? LIMIT 1  [["id", 0]]
---
	def show     # would show the details of a specific item
		@article = Article.find(params[:id])

INSERT INTO "articles" ("body", "created_at", "title", "updated_at") VALUES (?, ?, ?, ?)  [["body", "something not important"], ["created_at", "2014-05-24 17:06:23.095575"], ["title", "My article 1"], ["updated_at", "2014-05-24 17:06:23.095575"]]
---
	def create   # creates a record with data and normally redirects to index
		@article = Article.new(articles_params)

		if @article.save

SELECT  "articles".* FROM "articles"  WHERE "articles"."id" = ? LIMIT 1  [["id", 1]]
---
	def edit    # takes a param of what spesific record I want to edit then populates a form and display it to user
		@article = Article.find(params[:id])

SELECT  "articles".* FROM "articles"  WHERE "articles"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "articles" SET "body" = ?, "updated_at" = ? WHERE "articles"."id" = 1  [["body", "something not importnt but now important"], ["updated_at", "2014-05-24 17:06:45.934813"]]
---
	def update  # Info is passed from edit just like (new), it seeks the record in database and updates it then redirects
		@article = Article.find(params[:id])

		if @article.update_attributes(articles_params)

SELECT  "articles".* FROM "articles"  WHERE "articles"."id" = ? LIMIT 1  [["id", 2]]
DELETE FROM "articles" WHERE "articles"."id" = ?  [["id", 2]]
---
	def destroy # pass it if for an object it will destroy it and redirects
       @article = Article.find(params[:id])
       @article.destroy